#+title: readme.org

* SQL + Python Learning System in Emacs/Org-mode
** Core Architecture
*** Directory Structure
#+begin_src 
~/learn-sql/
├── .venv/                    # Python virtual environment
├── sql/                      # Pure SQL files (syntax highlighted, lintable)
│   ├── 01-select-basics.sql
│   ├── 02-aggregations.sql
│   └── ...
├── notebooks/                # Org-mode "notebooks"
│   └── lesson-01.org
├── utils/
│   └── query.py              # Helper to load & run SQL from files
├── .dir-locals.el            # Project-level Emacs config
└── requirements.txt          # google-cloud-bigquery, pandas, db-dtypes
#+end_src

*** =requirements.txt=
#+begin_src text :tangle ./requirements.txt
google-cloud-bigquery
pandas
db-dtypes
pyarrow
#+end_src

*** lsp server
#+begin_src bash
  .venv/bin/pip install "python-lsp-server[all]"
#+end_src

#+RESULTS:
| Collecting   | python-lsp-server[all]                     |                                                                                                          |                                                                         |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | python_lsp_server-1.14.0-py3-none-any.whl.metadata                                                       | (10                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | docstring-to-markdown                      | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | docstring_to_markdown-0.17-py3-none-any.whl.metadata                                                     | (2.3                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | jedi<0.20.0,>=0.17.2                       | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | jedi-0.19.2-py2.py3-none-any.whl.metadata                                                                | (22                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pluggy>=1.0.0                              | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pluggy-1.6.0-py3-none-any.whl.metadata                                                                   | (4.8                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | python-lsp-jsonrpc<2.0.0,>=1.1.0           | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | python_lsp_jsonrpc-1.1.2-py3-none-any.whl.metadata                                                       | (1.5                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | ujson>=3.0.0                               | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | ujson-5.11.0-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata                        | (9.4                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | black                                      | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | black-26.1.0-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl.metadata   | (88                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | autopep8<2.1.0,>=2.0.4                     | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | autopep8-2.0.4-py2.py3-none-any.whl.metadata                                                             | (17                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | flake8<8,>=7.1                             | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Downloading  | flake8-7.3.0-py2.py3-none-any.whl.metadata | (3.8                                                                                                     | kB)                                                                     |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | mccabe<0.8.0,>=0.7.0                       | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | mccabe-0.7.0-py2.py3-none-any.whl.metadata                                                               | (5.0                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pycodestyle<2.13.0,>=2.12.0                | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pycodestyle-2.12.1-py2.py3-none-any.whl.metadata                                                         | (4.5                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pydocstyle<6.4.0,>=6.3.0                   | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pydocstyle-6.3.0-py3-none-any.whl.metadata                                                               | (3.7                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pyflakes<3.3.0,>=3.2.0                     | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pyflakes-3.2.0-py2.py3-none-any.whl.metadata                                                             | (3.5                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pylint<4.1.0,>=3.1                         | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pylint-4.0.5-py3-none-any.whl.metadata                                                                   | (12                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | rope>=1.11.0                               | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | rope-1.14.0-py3-none-any.whl.metadata                                                                    | (6.5                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | yapf>=0.33.0                               | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | yapf-0.43.0-py3-none-any.whl.metadata                                                                    | (46                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | whatthepatch<2.0.0,>=1.0.2                 | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | whatthepatch-1.0.7-py3-none-any.whl.metadata                                                             | (7.2                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| INFO:        | pip                                        | is                                                                                                       | looking                                                                 | at            | multiple                             | versions   | of                                                                                      | flake8        | to                       | determine   | which        | version      | is                    | compatible  | with           | other              | requirements. | This               | could            | take           | a            | while.                   |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | flake8<8,>=7.1                             | (from                                                                                                    | python-lsp-server[all])                                                 |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Downloading  | flake8-7.2.0-py2.py3-none-any.whl.metadata | (3.8                                                                                                     | kB)                                                                     |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | flake8-7.1.2-py2.py3-none-any.whl.metadata                                                               | (3.8                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | parso<0.9.0,>=0.8.4                        | (from                                                                                                    | jedi<0.20.0,>=0.17.2->python-lsp-server[all])                           |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | parso-0.8.6-py2.py3-none-any.whl.metadata                                                                | (8.4                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | snowballstemmer>=2.2.0                     | (from                                                                                                    | pydocstyle<6.4.0,>=6.3.0->python-lsp-server[all])                       |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | snowballstemmer-3.0.1-py3-none-any.whl.metadata                                                          | (7.9                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | astroid<=4.1.dev0,>=4.0.2                  | (from                                                                                                    | pylint<4.1.0,>=3.1->python-lsp-server[all])                             |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | astroid-4.0.4-py3-none-any.whl.metadata                                                                  | (4.4                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | dill>=0.3.6                                | (from                                                                                                    | pylint<4.1.0,>=3.1->python-lsp-server[all])                             |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | dill-0.4.1-py3-none-any.whl.metadata                                                                     | (10                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | isort!=5.13,<9,>=5                         | (from                                                                                                    | pylint<4.1.0,>=3.1->python-lsp-server[all])                             |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Downloading  | isort-8.0.1-py3-none-any.whl.metadata      | (11                                                                                                      | kB)                                                                     |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | platformdirs>=2.2                          | (from                                                                                                    | pylint<4.1.0,>=3.1->python-lsp-server[all])                             |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | platformdirs-4.9.2-py3-none-any.whl.metadata                                                             | (4.7                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | tomlkit>=0.10.1                            | (from                                                                                                    | pylint<4.1.0,>=3.1->python-lsp-server[all])                             |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | tomlkit-0.14.0-py3-none-any.whl.metadata                                                                 | (2.8                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pytoolconfig>=1.2.2                        | (from                                                                                                    | pytoolconfig[global]>=1.2.2->rope>=1.11.0->python-lsp-server[all])      |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pytoolconfig-1.3.1-py3-none-any.whl.metadata                                                             | (1.4                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Requirement  | already                                    | satisfied:                                                                                               | packaging>=23.2                                                         | in            | ./.venv/lib/python3.12/site-packages | (from      | pytoolconfig>=1.2.2->pytoolconfig[global]>=1.2.2->rope>=1.11.0->python-lsp-server[all]) | (26.0)        |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | click>=8.0.0                               | (from                                                                                                    | black->python-lsp-server[all])                                          |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | click-8.3.1-py3-none-any.whl.metadata                                                                    | (2.6                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | mypy-extensions>=0.4.3                     | (from                                                                                                    | black->python-lsp-server[all])                                          |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | mypy_extensions-1.1.0-py3-none-any.whl.metadata                                                          | (1.1                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pathspec>=1.0.0                            | (from                                                                                                    | black->python-lsp-server[all])                                          |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pathspec-1.0.4-py3-none-any.whl.metadata                                                                 | (13                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | pytokens>=0.3.0                            | (from                                                                                                    | black->python-lsp-server[all])                                          |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pytokens-0.4.1-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl.metadata | (3.8                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | importlib-metadata>=3.6                    | (from                                                                                                    | docstring-to-markdown->python-lsp-server[all])                          |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | importlib_metadata-8.7.1-py3-none-any.whl.metadata                                                       | (4.7                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Requirement  | already                                    | satisfied:                                                                                               | typing_extensions>=4.6                                                  | in            | ./.venv/lib/python3.12/site-packages | (from      | docstring-to-markdown->python-lsp-server[all])                                          | (4.15.0)      |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Collecting   | zipp>=3.20                                 | (from                                                                                                    | importlib-metadata>=3.6->docstring-to-markdown->python-lsp-server[all]) |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | zipp-3.23.0-py3-none-any.whl.metadata                                                                    | (3.6                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | python_lsp_server-1.14.0-py3-none-any.whl                                                                | (77                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | autopep8-2.0.4-py2.py3-none-any.whl                                                                      | (45                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | flake8-7.1.2-py2.py3-none-any.whl                                                                        | (57                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | jedi-0.19.2-py2.py3-none-any.whl                                                                         | (1.6                                                                    | MB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | mccabe-0.7.0-py2.py3-none-any.whl                                                                        | (7.3                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | parso-0.8.6-py2.py3-none-any.whl                                                                         | (106                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pycodestyle-2.12.1-py2.py3-none-any.whl                                                                  | (31                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pydocstyle-6.3.0-py3-none-any.whl                                                                        | (38                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pyflakes-3.2.0-py2.py3-none-any.whl                                                                      | (62                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pylint-4.0.5-py3-none-any.whl                                                                            | (536                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | astroid-4.0.4-py3-none-any.whl                                                                           | (276                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Downloading  | isort-8.0.1-py3-none-any.whl               | (89                                                                                                      | kB)                                                                     |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | python_lsp_jsonrpc-1.1.2-py3-none-any.whl                                                                | (8.8                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | whatthepatch-1.0.7-py3-none-any.whl                                                                      | (11                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | dill-0.4.1-py3-none-any.whl                                                                              | (120                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | platformdirs-4.9.2-py3-none-any.whl                                                                      | (21                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pluggy-1.6.0-py3-none-any.whl                                                                            | (20                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | rope-1.14.0-py3-none-any.whl                                                                             | (207                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pytoolconfig-1.3.1-py3-none-any.whl                                                                      | (17                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | snowballstemmer-3.0.1-py3-none-any.whl                                                                   | (103                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | tomlkit-0.14.0-py3-none-any.whl                                                                          | (39                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | ujson-5.11.0-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl                                 | (57                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | yapf-0.43.0-py3-none-any.whl                                                                             | (256                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | black-26.1.0-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl            | (1.8                                                                    | MB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | click-8.3.1-py3-none-any.whl                                                                             | (108                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | mypy_extensions-1.1.0-py3-none-any.whl                                                                   | (5.0                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pathspec-1.0.4-py3-none-any.whl                                                                          | (55                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | pytokens-0.4.1-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl          | (269                                                                    | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | docstring_to_markdown-0.17-py3-none-any.whl                                                              | (23                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | importlib_metadata-8.7.1-py3-none-any.whl                                                                | (27                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Using        | cached                                     | zipp-3.23.0-py3-none-any.whl                                                                             | (10                                                                     | kB)           |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Installing   | collected                                  | packages:                                                                                                | zipp,                                                                   | whatthepatch, | ujson,                               | tomlkit,   | snowballstemmer,                                                                        | pytoolconfig, | pytokens,                | pyflakes,   | pycodestyle, | pluggy,      | platformdirs,         | pathspec,   | parso,         | mypy-extensions,   | mccabe,       | isort,             | dill,            | click,         | astroid,     | yapf,                    | python-lsp-jsonrpc,      | pylint,        | pydocstyle,        | jedi,       | importlib-metadata,   | flake8,        | black,       | autopep8,          | rope,       | docstring-to-markdown, | python-lsp-server |
|              |                                            |                                                                                                          |                                                                         |               |                                      |            |                                                                                         |               |                          |             |              |              |                       |             |                |                    |               |                    |                  |                |              |                          |                          |                |                    |             |                       |                |              |                    |             |                        |                   |
| Successfully | installed                                  | astroid-4.0.4                                                                                            | autopep8-2.0.4                                                          | black-26.1.0  | click-8.3.1                          | dill-0.4.1 | docstring-to-markdown-0.17                                                              | flake8-7.1.2  | importlib-metadata-8.7.1 | isort-8.0.1 | jedi-0.19.2  | mccabe-0.7.0 | mypy-extensions-1.1.0 | parso-0.8.6 | pathspec-1.0.4 | platformdirs-4.9.2 | pluggy-1.6.0  | pycodestyle-2.12.1 | pydocstyle-6.3.0 | pyflakes-3.2.0 | pylint-4.0.5 | python-lsp-jsonrpc-1.1.2 | python-lsp-server-1.14.0 | pytokens-0.4.1 | pytoolconfig-1.3.1 | rope-1.14.0 | snowballstemmer-3.0.1 | tomlkit-0.14.0 | ujson-5.11.0 | whatthepatch-1.0.7 | yapf-0.43.0 | zipp-3.23.0            |                   |

*** =.dir-locals.el=
#+begin_src elisp :tangle .dir-locals.el
((nil . ((pyvenv-activate . ".venv"))))
#+end_src

---

** Key Piece: SQL Loader Utility

*=utils/query.py=*
#+begin_src python :tangle utils/query.py
from pathlib import Path
from google.cloud import bigquery

CLIENT = bigquery.Client()
SQL_DIR = Path(__file__).resolve().parent.parent / "sql"

def load_sql(name: str, **params) -> str:
    """Load a .sql file and optionally format with parameters."""
    path = SQL_DIR / name
    sql = path.read_text()
    if params:
        sql = sql.format(**params)
    return sql

def run(name: str, **params):
    """Load SQL file, execute on BigQuery, return DataFrame."""
    sql = load_sql(name, **params)
    return CLIENT.query(sql).to_dataframe()
#+end_src

---

** Example SQL File

*=sql/01-select-basics.sql=* — full syntax highlighting, linting, completion:
#+begin_src sql :tangle sql/01-select-basics.sql
-- Kaggle: bigquery-public-data.world_bank_intl_education
SELECT
    country_name,
    indicator_name,
    value
FROM
    `bigquery-public-data.world_bank_intl_education.international_education`
WHERE
    indicator_code = '{indicator_code}'
    AND year = {year}
ORDER BY value DESC
LIMIT {limit}
#+end_src

---

** Example Org-mode Notebook

*=notebooks/lesson-01.org=*
#+begin_src org :tangle notebooks/lesson-01.org
#+title: Lesson 01 — SELECT Basics
#+property: header-args:python :session *bq* :results output

** Setup
#+begin_src python
import sys
sys.path.insert(0, "../utils")
from query import run, load_sql
#+end_src

** Inspect the raw SQL
#+begin_src python
print(load_sql("01-select-basics.sql",
               indicator_code="SE.PRM.ENRR", year=2015, limit=10))
#+end_src

** Run it
#+begin_src python :results value table
df = run("01-select-basics.sql",
         indicator_code="SE.PRM.ENRR", year=2015, limit=10)
print(df.to_string())
#+end_src

** Notes
- =WHERE= filters rows before aggregation
- Backtick syntax is BigQuery-specific for project.dataset.table
#+end_src

You get *Python highlighting* in the =#+begin_src python= blocks and *SQL highlighting* when you open the =.sql= files directly. The separation is the key insight — don't embed SQL in Python strings.

---

** Emacs Configuration

#+begin_src elisp
;; --- Virtual environment ---
(use-package pyvenv
  :ensure t
  :hook (python-mode . (lambda ()
                         (when (and (project-current)
                                    (file-exists-p (concat (project-root (project-current)) ".venv")))
                           (pyvenv-activate (concat (project-root (project-current)) ".venv"))))))

;; --- Org-babel ---
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (sql . t)))

(setq org-confirm-babel-evaluate nil)  ; convenience for learning; be careful

;; --- SQL mode ---
(setq sql-product 'ansi)  ; or install a BigQuery mode

;; --- Optional: polymode for SQL-in-Python (if you ever inline) ---
;; (use-package polymode ...)  ; not needed with the file-based approach
#+end_src

---

** Recommendations Beyond Immediate Scope

*** 1. *Authentication*
Set =GOOGLE_APPLICATION_CREDENTIALS= env var or use =gcloud auth application-default login=. Add to your Org file's setup block or =.envrc= (with =direnv=):
#+begin_src elisp
;; In .dir-locals.el or direnv
(setenv "GOOGLE_APPLICATION_CREDENTIALS" "/path/to/service-account.json")
#+end_src

*** 2. *Cost Control*
BigQuery charges per bytes scanned. Add a dry-run helper:
#+begin_src python
def dry_run(name: str, **params):
    sql = load_sql(name, **params)
    job_config = bigquery.QueryJobConfig(dry_run=True, use_query_cache=False)
    job = CLIENT.query(sql, job_config=job_config)
    mb = job.total_bytes_processed / 1e6
    print(f"This query will process {mb:.1f} MB")
#+end_src

*** 3. *Parameterization — Use BigQuery's Native Parameters*
=str.format()= is fine for learning but vulnerable to injection. For anything beyond throwaway queries:
#+begin_src python
from google.cloud.bigquery import ScalarQueryParameter, QueryJobConfig

def run_parameterized(name, params: list[ScalarQueryParameter]):
    sql = (SQL_DIR / name).read_text()
    config = QueryJobConfig(query_parameters=params)
    return CLIENT.query(sql, job_config=config).to_dataframe()
#+end_src

*** 4. *SQL Linting/Formatting*
Install =sqlfluff= (=pip install sqlfluff=) and configure for BigQuery dialect:
#+begin_src ini
# .sqlfluff
[sqlfluff]
dialect = bigquery
#+end_src
Then in Emacs use =reformatter.el= or =apheleia= to format on save.

*** 5. *Caching Results Locally*
Avoid re-running expensive queries during iteration:
#+begin_src python
import hashlib, pickle
from pathlib import Path

CACHE_DIR = Path("~/.cache/bq-learn").expanduser()
CACHE_DIR.mkdir(exist_ok=True)

def run_cached(name, **params):
    sql = load_sql(name, **params)
    key = hashlib.sha256(sql.encode()).hexdigest()[:16]
    cache_path = CACHE_DIR / f"{key}.pkl"
    if cache_path.exists():
        return pickle.loads(cache_path.read_bytes())
    df = CLIENT.query(sql).to_dataframe()
    cache_path.write_bytes(pickle.dumps(df))
    return df
#+end_src

*** 6. *Version Control & Spaced Repetition*
- Git-track everything (SQL files become a personal reference library)
- Tag Org headings with difficulty/review dates — integrates with =org-drill= or =org-fc= for spaced repetition of SQL patterns

*** 7. *Progressive Complexity Path*
Structure your SQL files to build on each other:
#+begin_src 
sql/
├── 01-select/
├── 02-where-filter/
├── 03-aggregation/
├── 04-joins/
├── 05-subqueries/
├── 06-window-functions/
├── 07-ctes/
└── 08-optimization/  # EXPLAIN, partitioning, clustering
#+end_src

*** 8. *Org-mode Tangling as an Alternative*
If you ever /do/ want SQL inline in Org with highlighting, you can use =#+begin_src sql :tangle ../sql/01-select-basics.sql= — edit with full SQL highlighting via =C-c '=, and =org-babel-tangle= writes the files. This keeps a single-source-of-truth notebook while still producing standalone =.sql= files.
